---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinition.Name
source: html/16a69a5a-d192-6d24-20b2-42160c9f27ae.htm
---
# Autodesk.Revit.DB.ExternalDefinition.Name Property

The user visible name for the parameter.

## Syntax (C#)
```csharp
public override string Name { get; }
```